package com.example.owner.majan;

/**
 * Created by Owner on 2015/06/16.
 */
public class Tensu {


    private final String tensu_oya_ron [][]={{"","2400","4800","9600"},{"1500","2900","5800","11600"}
            ,{"2000","3900","7700","12000"},{"2400","4800","9600","12000"},{"2900","5800","11600","12000"}
    ,{"3400","6800","12000","12000"},{"3900","7700","12000","12000"}
    ,{"4400","8700","12000","12000"},{"4800","9600","12000","12000"}
    ,{"5300","10600"}};

    private final String tensu_oya_tumo[][]={{"　","700点オール","1300点オール","2600点オール"}
    ,{"","","1600点オール","3200点オール"},{"500点オール","1000点オール","2000点オール","3900点オール"}
    ,{"700点オール","1300点オール","2600点オール","4000点オール"},{"800点オール","1600点オール","3200点オール","4000点オール"}
    ,{"1000点オール","2000点オール","3900点オール","4000点オール"},{"1200点オール","2300点オール","4000点オール","4000点オール"}
    ,{"1300点オール","2600点オール","4000点オール","4000点オール"},{"1500点オール","2900点オール","4000点オール","4000点オール"}
    ,{"1600点オール","3200点オール","4000点オール","4000点オール"},{"1800点オール","3600点オール","4000点オール","4000点オール"}};


    public String Get_oya_ron_tesu(int han,int yakusuu){

        han=han/10;
        han=han-1;


        return tensu_oya_ron[han-1][yakusuu-1];

    }

    public String Get_oya_tumo_tesu(int han,int yakusuu){

        han=han/10;
        han=han-1;

        return tensu_oya_tumo[han-1][yakusuu-1];

    }
}


